SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/MGM24/Include/mgm24_frc.h
#define _FRC_SEQIF_RXRAWOF_SHIFT                           22                                               /**< Shift value for FRC_RXRAWOF                 */
#define _FRC_SEQIF_RXRAWOF_MASK                            0x400000UL                                       /**< Bit mask for FRC_RXRAWOF                    */
#define _FRC_SEQIF_RXRAWOF_DEFAULT                         0x00000000UL                                     /**< Mode DEFAULT for FRC_SEQIF                  */
#define FRC_SEQIF_RXRAWOF_DEFAULT                          (_FRC_SEQIF_RXRAWOF_DEFAULT << 22)               /**< Shifted mode DEFAULT for FRC_SEQIF          */
#define FRC_SEQIF_WCNTCMP5                                 (0x1UL << 23)                                    /**< Word Counter Compare 5 Event                */
#define _FRC_SEQIF_WCNTCMP5_SHIFT                          23                                               /**< Shift value for FRC_WCNTCMP5                */
#define _FRC_SEQIF_WCNTCMP5_MASK                           0x800000UL                                       /**< Bit mask for FRC_WCNTCMP5                   */
#define _FRC_SEQIF_WCNTCMP5_DEFAULT                        0x00000000UL                                     /**< Mode DEFAULT for FRC_SEQIF                  */
#define FRC_SEQIF_WCNTCMP5_DEFAULT                         (_FRC_SEQIF_WCNTCMP5_DEFAULT << 23)              /**< Shifted mode DEFAULT for FRC_SEQIF          */
#define FRC_SEQIF_FRAMEDETPAUSED                           (0x1UL << 24)                                    /**< Frame detected pause event active           */
#define _FRC_SEQIF_FRAMEDETPAUSED_SHIFT                    24                                               /**< Shift value for FRC_FRAMEDETPAUSED          */
#define _FRC_SEQIF_FRAMEDETPAUSED_MASK                     0x1000000UL                                      /**< Bit mask for FRC_FRAMEDETPAUSED             */
#define _FRC_SEQIF_FRAMEDETPAUSED_DEFAULT                  0x00000000UL                                     /**< Mode DEFAULT for FRC_SEQIF                  */
#define FRC_SEQIF_FRAMEDETPAUSED_DEFAULT                   (_FRC_SEQIF_FRAMEDETPAUSED_DEFAULT << 24)        /**< Shifted mode DEFAULT for FRC_SEQIF          */
#define FRC_SEQIF_INTERLEAVEWRITEPAUSED                    (0x1UL << 25)                                    /**< Interleaver write pause event active        */
#define _FRC_SEQIF_INTERLEAVEWRITEPAUSED_SHIFT             25                                               /**< Shift value for FRC_INTERLEAVEWRITEPAUSED   */
#define _FRC_SEQIF_INTERLEAVEWRITEPAUSED_MASK              0x2000000UL                                      /**< Bit mask for FRC_INTERLEAVEWRITEPAUSED      */
#define _FRC_SEQIF_INTERLEAVEWRITEPAUSED_DEFAULT           0x00000000UL                                     /**< Mode DEFAULT for FRC_SEQIF                  */
#define FRC_SEQIF_INTERLEAVEWRITEPAUSED_DEFAULT            (_FRC_SEQIF_INTERLEAVEWRITEPAUSED_DEFAULT << 25) /**< Shifted mode DEFAULT for FRC_SEQIF          */
#define FRC_SEQIF_INTERLEAVEREADPAUSED                     (0x1UL << 26)                                    /**< Interleaver read pause event active         */
#define _FRC_SEQIF_INTERLEAVEREADPAUSED_SHIFT              26                                               /**< Shift value for FRC_INTERLEAVEREADPAUSED    */
#define _FRC_SEQIF_INTERLEAVEREADPAUSED_MASK               0x4000000UL                                      /**< Bit mask for FRC_INTERLEAVEREADPAUSED       */
#define _FRC_SEQIF_INTERLEAVEREADPAUSED_DEFAULT            0x00000000UL                                     /**< Mode DEFAULT for FRC_SEQIF                  */
#define FRC_SEQIF_INTERLEAVEREADPAUSED_DEFAULT             (_FRC_SEQIF_INTERLEAVEREADPAUSED_DEFAULT << 26)  /**< Shifted mode DEFAULT for FRC_SEQIF          */
#define FRC_SEQIF_TXSUBFRAMEPAUSED                         (0x1UL << 27)                                    /**< Transmit subframe pause event active        */
#define _FRC_SEQIF_TXSUBFRAMEPAUSED_SHIFT                  27                                               /**< Shift value for FRC_TXSUBFRAMEPAUSED        */
#define _FRC_SEQIF_TXSUBFRAMEPAUSED_MASK                   0x8000000UL                                      /**< Bit mask for FRC_TXSUBFRAMEPAUSED           */
#define _FRC_SEQIF_TXSUBFRAMEPAUSED_DEFAULT                0x00000000UL                                     /**< Mode DEFAULT for FRC_SEQIF                  */
#define FRC_SEQIF_TXSUBFRAMEPAUSED_DEFAULT                 (_FRC_SEQIF_TXSUBFRAMEPAUSED_DEFAULT << 27)      /**< Shifted mode DEFAULT for FRC_SEQIF          */
#define FRC_SEQIF_CONVPAUSED                               (0x1UL << 28)                                    /**< Convolutional coder pause event active      */
#define _FRC_SEQIF_CONVPAUSED_SHIFT                        28                                               /**< Shift value for FRC_CONVPAUSED              */
#define _FRC_SEQIF_CONVPAUSED_MASK                         0x10000000UL                                     /**< Bit mask for FRC_CONVPAUSED                 */
#define _FRC_SEQIF_CONVPAUSED_DEFAULT                      0x00000000UL                                     /**< Mode DEFAULT for FRC_SEQIF                  */
#define FRC_SEQIF_CONVPAUSED_DEFAULT                       (_FRC_SEQIF_CONVPAUSED_DEFAULT << 28)            /**< Shifted mode DEFAULT for FRC_SEQIF          */
#define FRC_SEQIF_RXWORD                                   (0x1UL << 29)                                    /**< Receive Word Interrupt Flag                 */
#define _FRC_SEQIF_RXWORD_SHIFT                            29                                               /**< Shift value for FRC_RXWORD                  */
#define _FRC_SEQIF_RXWORD_MASK                             0x20000000UL                                     /**< Bit mask for FRC_RXWORD                     */
#define _FRC_SEQIF_RXWORD_DEFAULT                          0x00000000UL                                     /**< Mode DEFAULT for FRC_SEQIF                  */
#define FRC_SEQIF_RXWORD_DEFAULT                           (_FRC_SEQIF_RXWORD_DEFAULT << 29)                /**< Shifted mode DEFAULT for FRC_SEQIF          */
#define FRC_SEQIF_TXWORD                                   (0x1UL << 30)                                    /**< Transmit Word Interrupt Flag                */
#define _FRC_SEQIF_TXWORD_SHIFT                            30                                               /**< Shift value for FRC_TXWORD                  */
#define _FRC_SEQIF_TXWORD_MASK                             0x40000000UL                                     /**< Bit mask for FRC_TXWORD                     */
#define _FRC_SEQIF_TXWORD_DEFAULT                          0x00000000UL                                     /**< Mode DEFAULT for FRC_SEQIF                  */
#define FRC_SEQIF_TXWORD_DEFAULT                           (_FRC_SEQIF_TXWORD_DEFAULT << 30)                /**< Shifted mode DEFAULT for FRC_SEQIF          */
#define FRC_SEQIF_UARTERROR                                (0x1UL << 31)                                    /**< Uart Error Interrupt Flag                   */
#define _FRC_SEQIF_UARTERROR_SHIFT                         31                                               /**< Shift value for FRC_UARTERROR               */
#define _FRC_SEQIF_UARTERROR_MASK                          0x80000000UL                                     /**< Bit mask for FRC_UARTERROR                  */
#define _FRC_SEQIF_UARTERROR_DEFAULT                       0x00000000UL                                     /**< Mode DEFAULT for FRC_SEQIF                  */
#define FRC_SEQIF_UARTERROR_DEFAULT                        (_FRC_SEQIF_UARTERROR_DEFAULT << 31)             /**< Shifted mode DEFAULT for FRC_SEQIF          */

